package ru.valera.bot.util;

import lombok.experimental.UtilityClass;

import java.util.List;

@UtilityClass
public class WordsUtil {

    public static final String MESSAGE_BOT_DESCRIPTION = "Привет. Я - Валера. Немного развлекательный, немного информационный бот. Примитивно отвечаю на " +
            "приветствие и обращение к производным от моего имени. Так же на команды с клавиатуры. Кроме этого делаю" +
            " небольшую ежедневную рассылку своего контента. Если я тебе надоел, либо мой контент для тебя не " +
            "приемлемый, можешь ввести команду '/end', либо перейти в бота и нажать снизу 'Остановить и блокировать', " +
            "либо слева, от поля ввода сообщений, нажать на 'Меню' и выбрать команду '/end' и обещаю больше тебя не тревожить";

    public static final String MESSAGE_BOT_DELETE = "Бот успешно остановлен, вы удалены из рассылки всех сообщений.";

    public static final List<String> GREETINGS = List.of(
            "Хай нигер", "Привет привет", "Дарова кожаный", "И тебе не хворать", "Как сам? Как сала килограмм? Или как молодой Ван Дам?",
            "Xай", "Привет друган", "Здравствуй хозяин", "Арасьте, забор покрасте", "Хело раша, хаваю?", "Привет пацаны",
            "Привет друзья", "Всем... Всем... Всем... Доброго времени суток", "Парни, эта, всем привет", "Привет кожаные",
            "Здрасте мордасте", "Ядрен Батон - ты прокрутон!", "Чо-каво? Как дела?", "Хаюшки", "Ох, как давно мы не виделись. Где ты пропадал, дружище? Как у тебя дела?",
            "Привет тебе, землянин! Повествуй мне о своей планете", "Трям! Здравствуйте!", "Гутен Морген!", "Однако, здравствуйте!",
            "Здравствуйте, я ваша тетя.", "Мой вам поклон кожаные.", "Привет, мои кожаные друзья", "Здравствуйте, товарищи!",
            "Гоп-стоп, мы подошли из-за угла.", "Привет, чуваки!", "Привет, собутыльники!", "Как дела? Лови краба!",
            "Приветствую вас, земляне!", "Здорово, братва!", "Привет, грешники!", "Рад видеть, Ваше величество!",
            "Гутен так!", "Шалом кожаный", "Шалом кожаные", "Здрямс!", "Бонжур", "Дратути хуятути!", "Как дела, старик?",
            "Хола!", "Привет, свет моих очей.", "У меня есть борода и ты скажешь мне: «Да».", "Просто здравствуй, просто как дела.",
            "Мои седины, кого я вижу!", "Здрасте!"
    );
    public static final List<String> ANSWER_FOR_VALERA = List.of(
            "Чо тебе", "А аааа", "Да мой господин", "Ну", "Говори", "Чо заспамить", "Ты взывал ко мне мой господин",
            "Ну что опять", "Да хозяин", "Чо те нада", "Ну что блять опять", "Ну что блядь опять", "Что", "Чо", "А",
            "Оу", "Босс, что", "Чего кожаный", "Кожаный, чего тебе", "Чего хотел мой кожаный друг"
    );
}
