package ru.bot.valera.bot.util;

import lombok.experimental.UtilityClass;

import java.util.List;

@UtilityClass
public class WordsUtil {

    public static final String MESSAGE_BOT_DESCRIPTION = "Приветствую тебя мой дорогой читатель. По кнопке" +
            " 'Настройки бота и рассылки' ты всегда сможешь отключить разделы, рассылаемых мной, ежедневных сообщений." +
            "Буду рад видеть тебя в моем чате(...) и канале(...)";

    public static final String MESSAGE_BOT_HELP = "Используй команду '/end' для остановки бота. Команду '/start для перезапуска бота'." +
            "По кнопке 'Настройки бота и рассылки' можешь отключить рассылаемый контент. Имей ввидо, что если контент привязан к " +
            "кнопкам основной клавиатуры, то в случае отключения, данная кнопка, работать, в том числе, не будет.";

    public static final String MESSAGE_BOT_DELETE = "Бот успешно остановлен, вы удалены из рассылки всех сообщений. Для возобновления активации клавиатуры и " +
            "и рассылки введите команду '\\start'";

    public static final List<String> GREETINGS = List.of(
            "Хай нигер", "Привет привет", "Дарова кожаный", "И тебе не хворать", "Как сам? Как сала килограмм? Или как молодой Ван Дам?",
            "Xай", "Привет друган", "Здравствуй хозяин", "Арасьте, забор покрасте", "Хело раша, хаваю?", "Привет пацаны",
            "Привет друзья", "Всем... Всем... Всем... Доброго времени суток", "Парни, эта, всем привет", "Привет кожаные",
            "Здрасте мордасте", "Ядрен Батон - ты прокрутон!", "Чо-каво? Как дела?", "Хаюшки", "Ох, как давно мы не виделись. Где ты пропадал, дружище? Как у тебя дела?",
            "Привет тебе, землянин! Повествуй мне о своей планете", "Трям! Здравствуйте!", "Гутен Морген!", "Однако, здравствуйте!",
            "Здравствуйте, я ваша тетя.", "Мой вам поклон кожаные.", "Привет, мои кожаные друзья", "Здравствуйте, товарищи!",
            "Гоп-стоп, мы подошли из-за угла.", "Привет, чуваки!", "Привет, собутыльники!", "Как дела? Лови краба!",
            "Приветствую вас, земляне!", "Здорово, братва!", "Привет, грешники!", "Рад видеть, Ваше величество!",
            "Гутен так!", "Шалом кожаный", "Шалом кожаные", "Здрямс!", "Бонжур", "Дратути хуятути!", "Как дела, старик?",
            "Хола!", "Привет, свет моих очей.", "У меня есть борода и ты скажешь мне: «Да».", "Просто здравствуй, просто как дела.",
            "Мои седины, кого я вижу!", "Здрасте!"
    );

    public static final List<String> GREETINGS_NEW_USER = List.of(
            "Приветствую мою дорогой друг", "Поприветствуем нового участника господа", "Пополнение... - это хорошо"
    );

    public static final List<String> COMENT_LEFT_USER = List.of(
            "Отряд не заметил потери бойца", "Несем потери"
    );

    public static final List<String> ANSWER_FOR_VALERA = List.of(
            "Чо тебе", "А аааа", "Да мой господин", "Ну", "Говори", "Чо заспамить", "Ты взывал ко мне мой господин",
            "Ну что опять", "Да хозяин", "Чо те нада", "Ну что блять опять", "Ну что блядь опять", "Что", "Чо", "А",
            "Оу", "Босс, что", "Чего кожаный", "Кожаный, чего тебе", "Чего хотел мой кожаный друг"
    );

    public static final List<String> TITS_CAPTION = List.of(
            "Титьки...Титьки... Титьки... Титьки", "Сиськи... Сиськи... Сиськи... Сиськи", "Кто сказал титьки", "Оооооо",
            "Как тебе такое Илон Макс", "Как вам", "Титьки заказывали?", "Что на это скажешь...", "Титек много не бывает",
            "Смотрите что у меня есть", "Вы только посмотрите что у меня есть"
    );

    public static final List<String> MANS_CAPTION = List.of(
            "Девочки! Контент по вам", "Девочки! Контент для вас", "Девочки, а для вас у меня тоже есть кое что интересное"
            , "Для милых дам выступает...."
    );

    public static final List<String> ANECDOTE_CAPTION = List.of(
            "*Анекдот:* \n\n", "*А такой анекдот слышали?:*\n\n", "*Рассказали мне тут анекдот как то:*\n\n",
            "*Анекдотчик из меня так себе, но сегодня я попробую:*\n\n", "*Новый анекдот:*\n\n",
            "*Старый, всеми позабытый, анекдот:*\n\n"
    );

    public static final List<String> STATUS_CAPTION = List.of(
            "*Пойдет на статус в контатке:* \n\n", "*Люди говорят:*\n\n", "*Как сказал выда ю щиий ся кто то там, когда то там:*\n\n",
            "*Как сказал известный кто то там, когда то там:*\n\n", "*Как сказал знаменитый кто то там, когда то там:*\n\n",
            "*НароднЫя мудрость гласит:*\n\n"
    );

    public static final List<String> GOOD_MORNING_P_1 = List.of(
            "*Доброе утро, ", "*Доброго утра, ", "*Доброго дня ", "*Прекрасного утра ", "*Прекрасного дня ",
            "*Чудесного утра ", "*Чудесного утра "
    );

    public static final List<String> GOOD_NIGHT_P_1 = List.of(
            "*Доброй ночи, ", "*Добрых снов, ", "*Приятных снов, ", "*Чудесных снов, ", "*Чудесных сновидений, ",
            "*Споки ноки, "
    );

    public static final List<String> GOOD_MORNING_END_LINE = List.of(
            "*Хорошего продуктивного дня! *", "*Не сдавайтесь! *", "*Вперед к звездам! *", "*Осилит идущий! *",
            "*Хорошего настроения! *", "*Бодрого утра! *", "*Все получится! *"
    );

    public static final List<String> FRIDAY_P_1 = List.of(
            "*С пятницей... ", "*С выходными... ", "*Всем чудесной пятницы... ", "*Всем чудесных выходных... ",
            "*Пятница идетЪ "
    );

    public static final List<String> GOOD_MORNING_NIGHT_FRIDAY_P_2 = List.of(
            "Друзья!!!* ", "Чат!!!* ", "Страна!!!* ", "Дорогие!!!* ", "Господа!!!* ", "Чатъ!!!* "
    );

    public static final List<String> EVENTS_OF_DAY = List.of(
            "*Итак, главные события за день:* \n\n ", "*Итак, за день произошло: * \n\n ", "*Итак, самое важное за день: *\n\n ",
            "*События дня: * \n\n ", "*Самое главное за день:* \n\n ", "*Самое важное за день:* \n\n ",
            "*Подведем итоги дня: *\n\n "
    );

    public static final List<String> ROCK_CAPTION = List.of(
            "*тот кто это понял... ну тот меня понял* ", "*поговорим про рок*", "*поговорим про самый настоящий рок*",
            "*а что ты знаешь про настоящий рок*", "*итааак, минутка рока*"
    );
}
